---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoat
source: html/a6dd33bc-4a86-a963-6ea7-c5d722657ebc.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintTopcoat Property

The property labeled "Top Coat" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintTopcoat { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".